{
  "education": [
    {
      "date": "2010-03-05",
      "certification": {
        "it": "Dottorato di Ricerca in Ingegneria Elettronica e Informatica (XXII Ciclo), con qualifica di Doctor Europaeus"
      },
      "source": "University of Cagliari - Department of Electrical and Electronic Engineering",
      "number": "Matricola n.08408"
    },
    {
      "date": "2006-02-27",
      "certification": {
        "it": "Iscrizione all’Albo Ordine degli Ingegneri della provincia di Cagliari, sezione A - Settori Civile-Ambientale, Industriale, dell’Informazione"
      },
      "number": "N.6218"
    },
    {
      "date": "2005-11-31",
      "certification": {
        "it": "Superamento dell’esame di stato per l’esercizio della professione di Ingegnere (II sessione 2005)"
      }
    },
    {
      "date": "2005-11-08",
      "certification": {
        "it": "Laurea in Ingegneria Elettronica; Tesi: Studio e Realizzazione di un’Architettura ad Agenti Software per il Recupero ed il Filtraggio di Informazioni dal World Wide Web; Relatore: Prof. G. Armano; Votazione: 96/110;"
      },
      "Source": "University of Cagliari - Department of Electrical and Electronic Engineering",
      "number": "70/13/26676"
    },
    {
      "date": "1994-07-20",
      "certification": {
        "it": "Maturità scientifica: Liceo Scientifico Lorenzo Mossa; Votazione: 56/60"
      }
    }
  ],
  "languages": [
    {
      "Italiano": {
        "writing": "native",
        "speaking": "native",
        "reading": "native",
        "listening": "native"
      }
    },
    {
      "Inglese": {
        "writing": "C1",
        "speaking": "C1",
        "reading": "C1",
        "listening": "C1",
        "certification": [
          "2007, CLA: Intermedio I – B1",
          "2008, CLA: Technical Scientific English – B2",
          "2009, CLA: Preparation to TOEFL – C1"
        ]
      }
    },
    {
      "French": {
        "writing": "A2",
        "speaking": "A2",
        "reading": "B1",
        "listening": "B1",
        "certification": [
          "Knowledge gained during eight primary and secondary school years"
        ]
      }
    },
    {
      "Spanish": {
        "writing": "B1",
        "speaking": "B1",
        "reading": "B1",
        "listening": "B1",
        "certification": [
          "2008, CLA (T): Elementary Level I – A2.1",
          "2009, [WA11]: Study activity during the working experience in Spain",
          "2010, CLA (T): Intermediate Level – B1"
        ]
      }
    },
    {
      "Chinese": {
        "writing": "A2",
        "speaking": "A2",
        "reading": "A2",
        "listening": "A2",
        "certification": [
          "2007, CLA: Elementary Level – A1",
          "2011-10: Elementary Level – A2"
        ]
      }
    }
  ],
  "certifications": [
    {
      "1986–1996": "Member F.I.V. – Federazione Italiana Vela, III Sezione, Costa Smeralda"
    },
    {
      "1996–1998": "Brevetto di asistente bagnanti, rilasciato dalla F.I.N., Federazione Italiana Nuoto, sez. Salvamento"
    },
    {
      "2003–2006": "Membro del CUS – Centro Universitario Sportivo, Cagliari"
    },
    {
      "2004–2005": "Membro ACIF – Associazione Culturale Italo Francese"
    },
    {
      "2004–2006": "Certificato F.I.T.A., Federazione Italiana Teatro Amatoriale"
    },
    {
      "from 1995": "Patente B Europea di guida"
    },
    {
      "from 1997": "PADI, Scuba Diving Certification, Livello Open Water Diver"
    },
    {
      "from 2005": "Iscritto all’Albo dell’Ordine degli Ingegneri della provincia di Cagliari sezione A, nei settori Civile-Ambientale, Industriale, dell’Informazione; N.6218"
    },
    {
      "from 2006": "Membro del JUG – Java User Group (Sardegna) Onlus"
    },
    {
      "from 2007": "Membro AIxIA – Italian Association for Artificial Intelligence, IADIS – International Association for Development of the Information Society"
    },
    {
      "from 2008": "membro ACM – Association for Computing Machinery"
    },
    {
      "from 2016": "Patente di guida Cinese"
    },
    {
      "from 2022": "Membro (114761) della Camera di Commercio Italiana in Cina"
    }
  ],
  "interests": [
    "Sport: Selezionato per i campionati regionali Under16 del 1991, giudice di linea per i campionati internazionali di tennis nel 1989, 1990",
    "Musica: Esperienza in gruppi musicali come autore, alla chitarra, alla tastiera. Attualmente chitarrista/batterista degli Allister (ex Annake). Produttore delle musiche per il backstage dei Fracasso Clandestino; regista: Fabrizio Derosas.",
    "Teatro: Esperienza in rappresentazioni teatrali, laboratori di teatro drammatico e recitazione nella commedia dell’arte classica.",
    "Amo viaggiare, condividere esperienze culturali e linguistiche. Membro attivo degli hospitality club più noti. Co-fondatore di Leganes Camina. Geocacher.",
    "Mi piacciono scacchi, enigmistica, giochi di logica e matematici, lateral thinking."
  ]
}
