{
    "affiliations": [
        {
            "logo": "/ReactCV/images/logo/logo_iasc.png",
            "name": "IASC",
            "url": "http://iascgroup.it/"
        },
        {
            "logo": "/ReactCV/images/logo/logo_diee.png",
            "name": "DIEE",
            "url": "http://www.diee.unica.it/"
        },
        {
            "logo": "/ReactCV/images/logo/logo_id.jpg",
            "name": "Information Devices",
            "url": "https://infodev.wordpress.com"
        },
        {
            "logo": "/ReactCV/images/logo/logo_infora.jpg",
            "name": "Infora",
            "url": "http://www.infora.it/"
        },
        {
            "logo": "/ReactCV/images/logo/logo_sprama.webp",
            "name": "Sprama Game Labs",
            "url": "http://www.spramagamelabs.it/"
        },
        {
            "logo": "/ReactCV/images/logo/logo_uc3m.jpg",
            "name": "UC3M - University Carlos III, Madrid",
            "url": "https://www.uc3m.es/"
        },
        {
            "logo": "/ReactCV/images/logo/logo_unica.png",
            "name": "UNICA - University of Cagliari",
            "url": "https://www.unica.it/"
        },
        {
            "logo": "/ReactCV/images/logo/logo_realt.png",
            "name": "RealT - Tehcnologies",
            "url": "https://www.realt.it/"
        },
        {
            "logo": "/ReactCV/images/logo/logo_abinsula.png",
            "name": "Abinsula",
            "url": "https://abinsula.com/it/"
        },
        {
            "logo": "/ReactCV/images/logo/logo_radix.png",
            "name": "Radix",
            "url": "https://www.radixgroup.it/"
        },
        {
            "logo": "/ReactCV/images/logo/logo_3wlab.jpg",
            "name": "3WLab",
            "url": "https://www.3wlab.it/"
        },
        {
            "logo": "/ReactCV/images/logo/logo_fis.png",
            "name": "FIS Global",
            "url": "https://www.fisglobal.com/"
        }
    ],
    "name": "Andrea Addis",
    "picture": {
        "en": "/ReactCV/images/profile/andrea_fake_en.jpg",
        "it": "/ReactCV/images/profile/andrea_fake_it.jpg",
        "zh": "/ReactCV/images/profile/andrea_fake_zh.jpg"
    },
    "productivity": {
        "en": "‣ Main virtualization systems and hypervisors, e.g., VMWare GSX, Oracle VirtualBox, DrupalPro 16\n‣ Build tools and dependency management, e.g, Maven, Ant, Gradle, Composer, npm.\n‣ Versioning tools (Git, SVN), and platforms (BitBucket, GitHub, GitLab, #RT)\n‣ Microsoft MsDos and Windows, Unix / BSD Desktop and Server administration of Microsoft PWS, IIS, Apache, Tomcat, Glassfish;\n‣ Setup, configuration and management of WAMP, LAMP stacks for Web Development and production.\n‣ Containerization of products and processes (e.g., see DockerHub).\n‣ Installation, setup and diagnosis of all major internal hardware components and external devices; installation, administration and protection of Local Area Networks; \n‣ Experience with single-board computers and micro controllers e.g., Arduino and Raspberry PI, ESP32. Filing and publication of patent N. [102016000099002](https://patents.google.com/patent/IT201600099002A1/it?assignee=infora&oq=infora) of a Sensing Board for the interaction and traceability of recognizable objects on a flexible surface.",
        "it": "‣ Principali sistemi di virtualizzazione e hypervisor, ad es., VMWare GSX, Oracle VirtualBox, DrupalPro 16\n‣ Strumenti di build e gestione delle dipendenze, ad es., Maven, Ant, Gradle, Composer, npm.\n‣ Strumenti di versioning (Git, SVN) e piattaforme (BitBucket, GitHub, GitLab, #RT)\n‣ Amministrazione desktop e server Microsoft MsDos e Windows, Unix / BSD di Microsoft PWS, IIS, Apache, Tomcat, Glassfish;\n‣ Installazione, configurazione e gestione di stack WAMP, LAMP per sviluppo web e produzione.\n‣ Containerizzazione di prodotti e processi (ad es., vedere DockerHub).\n‣ Installazione, configurazione e diagnosi di tutti i principali componenti hardware interni e dispositivi esterni; installazione, amministrazione e protezione di reti locali; \n‣ Esperienza con computer a scheda singola e microcontrollori, ad es., Arduino e Raspberry PI, ESP32. Deposito e pubblicazione del brevetto N. [102016000099002](https://patents.google.com/patent/IT201600099002A1/it?assignee=infora&oq=infora) di una Sensing Board per l'interazione e la tracciabilità di oggetti riconoscibili su una superficie flessibile.",
        "zh": "‣ 主要虚拟化系统和虚拟机监控程序，例如，VMWare GSX、Oracle VirtualBox、DrupalPro 16\n‣ 构建工具和依赖管理，例如，Maven、Ant、Gradle、Composer、npm。\n‣ 版本控制工具（Git、SVN）和平台（BitBucket、GitHub、GitLab、#RT）\n‣ Microsoft MsDos 和 Windows、Unix / BSD 桌面和服务器管理 Microsoft PWS、IIS、Apache、Tomcat、Glassfish；\n‣ 用于 Web 开发和生产的 WAMP、LAMP 堆栈的安装、配置和管理。\n‣ 产品和流程的容器化（例如，参见 DockerHub）。\n‣ 所有主要内部硬件组件和外部设备的安装、设置和诊断；局域网的安装、管理和保护；\n‣ 单板计算机和微控制器（例如，Arduino 和 Raspberry PI，ESP32）的经验。 传感板专利号 [102016000099002](https://patents.google.com/patent/IT201600099002A1/it?assignee=infora&oq=infora) 的申请和公布，用于在柔性表面上交互和跟踪可识别物体。"
    },
    "profile": {
        "en": "Ph.D. in Electronic Engineering and Computer Science, with extensive experience in research and development.\n\nI completed my Master’s Degree in Electronic Engineering in 2005 and earned a Ph.D. in Computer Science and Engineering with the Doctor Europaeus Qualification in 2009 at the University of Cagliari, Italy. Over seven years of research, I served as the primary author on over 30 peer-reviewed international and award-winning papers, gaining robust expertise in the development of Artificial Intelligence, Software Agents-based applications, Text Categorization, Bioinformatics, and Ambient Intelligence.\n\nBetween 2005 and 2012, I collaborated with the IASC (Intelligent Agents and Soft Computing) group at the Department of Electrical and Electronic Engineering (DIEE) of the University of Cagliari, Italy. The IASC group is a member of the European Network of Excellence in AI Planning and the European Network of Excellence for Agent-Based Computing. During this period, I engaged in teaching activities primarily focused on Database and Object-Oriented Programming, as well as research and development in Italian and European projects. In 2009, I moved to Spain to collaborate with the PLG (Planning and Learning Research Group) and CAOS (Control, Aprendizaje y Optimizacion de Sistemas) research groups at the University Carlos III of Madrid.\n\nIn 2011, I co-founded Infora, an enterprise dedicated to developing innovative tools and services. My responsibilities primarily involve service-oriented, desktop, and mobile architectures, as well as web application development for Government and Public Administrations. My professional profile showcases a robust understanding of object-oriented and agent-based programming. I have advanced skills in Java, JavaScript, and related web and application frameworks. Proficient in Php, I’ve developed and published numerous modules for Drupal, one of the leading CMS that I master. My expertise extends to custom library development for smart objects, mobile, and embedded devices, incorporating NFC and BLE protocols. I am proficient in GIS, and have contributed to libraries and mods for gaming, social networks, planning and networking solutions. My contributions also include the development of hardware, interfaces, and drivers for embedded devices, and my group invented and patented a new concept Gaming Board.\n\nThroughout my research and entrepreneurial journey, I’ve written and managed several projects focusing on industrial research and experimental development. As an architect, systems designer, analyst, and software engineer, I am proficient in project delivery methodologies, interoperability, and system and database administration, my expertise spans teaching, research, project management, industrial development, and consultancy. I have proven business and consulting experience, independently writing basic and industrial research projects, managing them from inception to closure, and coordinating with suppliers.\n\nIn 2021, I founded Sprama Game Labs S.r.l. The company is dedicated to the development, production, and marketing of innovative products or services with high technological value.",
        "it": "Dottore in Ingegneria Elettronica e Informatica all’Università degli Studi di Cagliari con esperienza pluriennale nella ricerca e nello sviluppo in ambito desktop, web e mobile.\n\nLaureato nel 2005 in Ingegneria Elettronica con una tesi sulle architetture ad agenti software, nel 2009 ottiene il dottorato di Ricerca in Ingegneria Elettronica e Informatica con qualifica di Doctor Europaeus presso il DIEE all’università di Cagliari. In 7 anni di ricerca è primo nome in più di 30 pubblicazioni internazionali su reti peer reviewed, ha maturato esperienza di ricerca e sviluppo su temi legati all’Intelligenza artificiale, in particolare, architetture ad agenti, categorizzazione del testo, bioinformatica e intelligenza d’ambiente.\n\nDal 2005 al 2012 ha collaborato con il gruppo IASC (Intelligent Agents and Soft Computing, membro della “European Network of Excellence in AI Planning” e della “European Network of Excellence for Agent-Based Computing”) presso il Dipartimento di Ingegneria Elettrica ed Elettronica dell’Università di Cagliari, impegnandosi in attività didattica, occupandosi di ricerca e sviluppo nell’ambito di progetti nazionali ed europei.\n\nNel 2009 lavora in Spagna con i gruppi “PLG, Planning and Learning research Group” e “CAOS, Control, Aprendizaje y Optimizacion de Sistemas” dell’Università Carlos III of Madrid.\n\nNel 2011 fonda, con altri ricercatori, la cooperativa Infora, un’impresa informatica per lo sviluppo di soluzioni software e web innovative. Esperto in problem solving, sviluppo di strumenti statistici, algoritmi di ricerca e apprendimento automatico, analista sviluppatore senior Java, PHP, Javascript ha sviluppato applicazioni web e mobile, portali per la pubblica amministrazione e moduli Drupal, applicativi Spring MVC e architetture service oriented. Ha sviluppato interfacce hardware e driver per prodotti embedded, inventando e brevettando un dispositivo a radiofrequenza, una Gaming Board di nuova concezione.\n\nNel 2021 fonda con i colleghi la S.r.l. Sprama Game Labs – La società ha per oggetto lo sviluppo, la produzione e la commercializzazione di prodotti o servizi innovativi ad alto valore tecnologico.\n\nHa sviluppato nel tempo esperienza commerciale, e nella gestione indipendente di progetti, dalla ricerca e prototipazione, dalla selezione dei fornitori e la collaborazione con il cliente, fino alla progettazione e sviluppo.\n\nNel 2014 si trasferisce in Cina per approfondire lo studio della lingua e della cultura cinese.",
        "zh": "我拥有电子工程和计算机科学博士学位以及丰富的研发经验。\n\n我于 2005 年获得电子工程硕士学位，2009 年在意大利卡利亚里大学获得计算机科学与工程博士学位，并获得欧洲博士学位资格。在七年的研究过程中，我作为主要作者发表了 30 多篇经同行评审的国际论文和获奖论文，在人工智能、基于软件代理的应用、文本分类、生物信息学和环境智能的开发方面积累了丰富的专业知识。\n\n2005 年至 2012 年间，我与意大利卡利亚里大学电气与电子工程系 IASC（智能代理与软计算）小组合作。IASC 小组是欧洲人工智能规划卓越网络（European Network of Excellence in AI Planning）和欧洲基于代理计算卓越网络（European Network of Excellence for Agent-Based Computing）的成员。在此期间，我主要从事数据库和面向对象编程方面的教学活动，以及意大利和欧洲项目的研发工作。2009 年，我来到西班牙，与马德里卡洛斯三世大学的 PLG（规划与学习研究小组）和 CAOS（系统控制、学习与优化）研究小组合作。\n\n2011 年，我与他人共同创办了 Infora，这是一家致力于开发创新工具和服务的企业。我的职责主要涉及面向服务、桌面和移动架构，以及政府和公共管理部门的网络应用程序开发。我的职业经历展示了我对面向对象和基于代理的编程的深刻理解。我拥有 Java、JavaScript 以及相关网络和应用框架方面的高级技能。我精通 Php，为 Drupal 开发并发布了大量模块，Drupal 是我掌握的领先内容管理系统之一。我的专长还包括为智能对象、移动设备和嵌入式设备开发定制库，并结合了 NFC 和 BLE 协议。我精通地理信息系统（GIS），并为游戏、社交网络、规划和网络解决方案的库和 mod 做出过贡献。我的贡献还包括为嵌入式设备开发硬件、接口和驱动程序，我所在的小组发明了一种新概念游戏板并申请了专利。\n\n在我的研究和创业历程中，我撰写和管理过多个项目，重点关注工业研究和实验开发。作为一名架构师、系统设计师、分析师和软件工程师，我精通项目交付方法、互操作性以及系统和数据库管理，我的专业领域涵盖教学、研究、项目管理、工业开发和咨询。我拥有成熟的业务和咨询经验，曾独立撰写基础和工业研究项目，管理项目从立项到结项的全过程，并协调与供应商的关系。\n\n2021 年，我创立了 Sprama Game Labs S.r.l.公司，致力于开发、生产和营销具有高技术价值的创新产品或服务。"
    },
    "profile_short": {
        "en": "Andrea Addis holds a PhD in Electronic Engineering and Computer Science with extensive experience in research and development. He obtained his Master's degree in Electronic Engineering in 2005 and his PhD in Computer Science and Engineering in 2009 from the University of Cagliari, earning the title of European Doctor. During his seven years of research activity, he published over 30 peer-reviewed and award-winning international papers as the first author, gaining significant expertise in AI-based applications, software agents, text classification, bioinformatics, and ambient intelligence. From 2005 to 2012, he collaborated with the IASC (Intelligent Agents and Soft Computing) group at the Department of Electrical and Electronic Engineering of the University of Cagliari, which is part of the European Networks of Excellence in AI Planning and Agent-Based Computing. He has taught courses on database (DB) and object-oriented programming (OOP) and participated in research and development projects in Italy and Europe. In 2009, he moved to Spain, working with the PLG (Planning and Learning Group) and CAOS (Control, Applications, and Optimization Systems) research groups at Universidad Carlos III de Madrid. In 2011, he co-founded Infora, a company focused on developing innovative tools and services. He specialized in service-oriented, desktop, and mobile architectures, web applications for government and public administration, and solutions based on Java frameworks and the CMS Drupal, for which he developed several modules. Throughout his research and entrepreneurial career, he has written and managed various projects focused on industrial research and experimental development. He has developed hardware, interfaces, and drivers for embedded devices, and his team invented and patented a new board game concept. In 2021, he co-founded S.r.l. Sprama Game Lab, a company dedicated to designing, producing, and commercializing innovative high-tech products and services.",
        "it": "Andrea Addis è un dottore in ingegneria elettronica e informatica con una lunga esperienza nella ricerca e sviluppo. Ha conseguito la laurea magistrale in ingegneria elettronica nel 2005 e il dottorato di ricerca in informatica e ingegneria nel 2009 presso l'Università di Cagliari, ottenendo il titolo di Dottore Europeo. Durante i suoi sette anni di attività di ricerca, ha pubblicato oltre 30 articoli scientifici peer-reviewed e premiati come primo autore, maturando una solida esperienza nello sviluppo di applicazioni basate su intelligenza artificiale e agenti software, classificazione del testo, bioinformatica e ambient intelligence. Dal 2005 al 2012 ha collaborato con il gruppo IASC (Intelligent Agents and Soft Computing) del Dipartimento di Ingegneria Elettrica ed Elettronica dell'Università di Cagliari, membro delle reti di eccellenza europee per la pianificazione AI e il calcolo basato su agenti. Ha svolto attività didattica su database (DB) e programmazione orientata agli oggetti (OOP) e ha partecipato a progetti di ricerca e sviluppo in Italia e in Europa. Nel 2009 si è trasferito in Spagna, collaborando con i gruppi di ricerca PLG (Planning and Learning Group) e CAOS (Control, Applications, and Optimization Systems) dell'Universidad Carlos III de Madrid. Nel 2011 ha co-fondato Infora, un'azienda focalizzata sullo sviluppo di strumenti e servizi innovativi, dove si è occupato di architetture orientate ai servizi, applicazioni web per la pubblica amministrazione e soluzioni software basate su Java e il CMS Drupal, per il quale ha sviluppato diversi moduli. Nel corso della sua carriera ha scritto e gestito numerosi progetti di ricerca industriale e sviluppo sperimentale. Ha sviluppato hardware, interfacce e driver per dispositivi embedded e ha guidato il team che ha inventato un nuovo concetto di gioco da tavolo, brevettandolo. Nel 2021 ha co-fondato S.r.l. Sprama Game Lab, un'azienda dedicata alla progettazione, produzione e commercializzazione di prodotti e servizi innovativi ad alto contenuto tecnologico.",
        "zh": "Andrea Addis是电子工程和计算机科学博士，长期从事研发工作。他于2005年获得电子工程硕士学位，2009年在意大利卡利亚里大学获得计算机科学与工程博士学位，并获得欧洲博士资格。在7年的研究活动中，他以第一作者的身份发表了30多篇同行评审的国际论文和获奖论文，在开发基于人工智能和软件代理的应用、文本分类、生物信息学和环境智能等方面积累了丰富的经验。2005年至2012年，他与意大利卡利亚里大学电气电子工程系的IASC（智能代理和软计算）小组合作。IASC小组是欧洲人工智能规划卓越网络和欧洲基于代理的计算卓越网络的成员。他主要从事DB和OOP主题的教学活动，意大利和欧洲项目的研发。2009年，他移居西班牙，与马德里卡洛斯三世大学的PLG（规划与学习研究小组）和CAOS（控制、应用与优化系统）研究小组合作。2011年，他与其他研究人员一起创立了Infora公司，这是一家以开发创新工具和服务为目标的企业。他主要负责面向服务、桌面和移动架构、政府和公共管理部门的网络应用程序开发，特别是基于Java框架和CMS Drupal，他为其开发了多个模块。在他的研究和创业经历中，他撰写并管理了几个专注于工业研究和实验开发的项目。他为嵌入式设备开发了硬件、接口和驱动程序，他的团队发明了一个新概念的游戏板并申请了专利。2021年，他与同事一起创建了S.r.l. Sprama游戏实验室 – 公司的宗旨是开发、生产和销售具有高技术价值的创新产品或服务。"
    },
    "research": {
        "en": "In 6 years of research activity from 2006 to 2012, I am first name on articles published for five over six international journal, seven book chapters, won a best paper award, and have my work accepted on more than twenty peer reviewed conferences.",
        "it": "In 6 anni di attività di ricerca dal 2006 al 2012, sono il primo autore di articoli pubblicati in cinque su sei riviste internazionali, sette capitoli di libri, ho vinto un premio per il miglior articolo e il mio lavoro è stato accettato in più di venti conferenze peer-reviewed.",
        "zh": "在 2006 年至 2012 年的 6 年研究活动中，我是六份国际期刊中五份发表文章的第一作者，七个书籍章节的作者，获得最佳论文奖，并且我的作品被二十多个同行评审会议接受。"
    },
    "technologies": {
        "en": "‣ Backend development with major languages and related frameworks: Java (Spring MVC, Boot, DropWizard, Thymeleaf), PHP and CMS (e.g., Symphony, Drupal, WordPress), Python for data science, machine learning and web development.\n‣ Web, Semantic Web, and Frontend development with JavaScript, TypeScript, React, Angular.\n‣ Relational databases (MySQL, PostgreSQL, Oracle), NoSQL (MongoDB, Elasticsearch, CouchBase) and ORM (JPA, Hibernate), Big Data Expertise and processing of large data collections (e.g., DMoz, the Reuters Corpus RCV2, Wikipedia, DBPedia, lexical-semantical databases as Wordnet, Wordnet Domains and related JWNL libraries)\n‣ Expert in creating wrappers, routing tools, and orchestration for Large Language Models, Retrieval-Augmented Generation, vector-based data processing architectures, and solutions for linguistic automation and text analysis.\n‣ Internet of Things custom libraries for smart objects and embedded devices NFC Tag, Bluetooth Low Energy;\n‣ GIS and maps integrated into applications\n‣ Text analysis and classification, computer vision and image processing, system planning\n‣ Gaming Mods and plugins development (e.g., Spigot Minecraft, SecondLife).\n‣ Applications and Libraries for Social networking (e.g., Facebook, Skype, Twitter, Reddit, PasteBin).\n‣ Expertise in client-server architectures, network protocols, RFC Standards\n‣ Native and Hybrid Android mobile development.",
        "it": "‣ Sviluppo backend con i principali linguaggi e framework correlati: Java (Spring MVC, Boot, DropWizard, Thymeleaf), PHP e CMS (ad es., Symphony, Drupal, WordPress), Python per data science, machine learning e sviluppo web.\n‣ Sviluppo Web, Web Semantico e Frontend con JavaScript, TypeScript, React, Angular.\n‣ Database relazionali (MySQL, PostgreSQL, Oracle), NoSQL (MongoDB, Elasticsearch, CouchBase) e ORM (JPA, Hibernate), Esperienza Big Data ed elaborazione di grandi raccolte di dati (ad es., DMoz, il Reuters Corpus RCV2, Wikipedia, DBPedia, database lessicali-semantici come Wordnet, Wordnet Domains e librerie JWNL correlate)\n‣ Esperto nella creazione di wrapper, strumenti di routing e orchestrazione per Large Language Models, Retrieval-Augmented Generation, architetture di elaborazione dati basate su vettori e soluzioni per l'automazione linguistica e l'analisi del testo.\n‣ Librerie personalizzate Internet of Things per oggetti intelligenti e dispositivi embedded NFC Tag, Bluetooth Low Energy;\n‣ GIS e mappe integrate nelle applicazioni\n‣ Analisi e classificazione del testo, visione artificiale ed elaborazione delle immagini, pianificazione del sistema\n‣ Sviluppo di mod e plugin per giochi (ad es., Spigot Minecraft, SecondLife).\n‣ Applicazioni e librerie per social networking (ad es., Facebook, Skype, Twitter, Reddit, PasteBin).\n‣ Esperienza in architetture client-server, protocolli di rete, standard RFC\n‣ Sviluppo mobile Android nativo e ibrido.",
        "zh": "‣ 使用主要语言和相关框架进行后端开发：Java（Spring MVC、Boot、DropWizard、Thymeleaf）、PHP 和 CMS（例如，Symphony、Drupal、WordPress）、用于数据科学、机器学习和 Web 开发的 Python。\n‣ 使用 JavaScript、TypeScript、React、Angular 进行 Web、语义 Web 和前端开发。\n‣ 关系数据库（MySQL、PostgreSQL、Oracle）、NoSQL（MongoDB、Elasticsearch、CouchBase）和 ORM（JPA、Hibernate）、大数据专业知识和大型数据集的处理（例如，DMoz、路透社语料库 RCV2、Wikipedia、DBPedia、词汇语义数据库，如 Wordnet、Wordnet Domains 和相关 JWNL 库）\n‣ 创建大型语言模型、检索增强生成、基于向量的数据处理架构以及语言自动化和文本分析解决方案的封装器、路由工具和编排方面的专家。\n‣ 智能对象和嵌入式设备 NFC 标签、蓝牙低功耗的物联网自定义库；\n‣ 集成到应用程序中的 GIS 和地图\n‣ 文本分析和分类、计算机视觉和图像处理、系统规划\n‣ 游戏模组和插件开发（例如，Spigot Minecraft、SecondLife）。\n‣ 社交网络应用程序和库（例如，Facebook、Skype、Twitter、Reddit、PasteBin）。\n‣ 客户端-服务器架构、网络协议、RFC 标准方面的专业知识\n‣ 原生和混合 Android 移动开发。"
    }
}